{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> Kundenmanager","text":"Weitere Informationen zum Modul Kundenmanager finden Sie in unserem Shop: https:\/\/www.oxidmodule.com\/OXID-eShop\/Module\/MODULNAME-fuer-Oxid-PE.html","tags":"","url":"index.html"},{"title":"Changelog","text":"unreleased 4.1.1.0 - (2020-12-21) - (aus Kompatibilitätsgründen zu Auftragsmanager-Release) ** Hinweis für kleinere Versions-Upgrades: Es gibt einige rückwärts-inkompatible Änderungen an dieser Version. ** Added Angepasst für Shopversion 6.2.3 Zufallspasswort wird im Installationsprozess erstellt CLI-Aufrufe ermöglicht Push Notification Aktion hinzugefügt Bedingungen verwenden QueryBuilder statt plain SQL Verwendung des Injection Containers integriert automatisierte Tests eingefügt Changed unnötige Parameterprüfung für Plain-Inhalte der Mails entfernt an Code des Autragsmanager Moduls angepasst Fixed Queryfehler korrigiert 3.3.0.0 - (2020-10-02) - (aus Kompatibilitätsgründen zu Ordermanager-Release) ** Hinweis für kleinere Versions-Upgrades: Es gibt einige rückwärts-inkompatible Änderungen an dieser Version. ** Added Angepasst für Shopversion 6.x, Installation via Composer 2.3.2.0 beim Speichern der Aktionen wird auf unzureichend ausgefüllte Werte hingewiesen beim Speichern der Bedingungen wird auf unzureichend ausgefüllte Werte hingewiesen fehlerhafte Abfragen für &quot;nicht in Kundengruppe&quot;, &quot;Registrierzeitraum&quot; und &quot;Bestellzeitraum&quot; korrigiert Einstellungen intuitiver benannt ermöglicht nichtnumerische Cronjob-IDs Abfrage für not-in-Zuordnungen korrigiert falsche Modul-ID korrigiert 2.3.1.0 gewählte Einträge als &quot;bearbeitet&quot; markieren neue Bedingung &quot;wenn Kundenkonto (nicht) durch Aufgabe X bearbeitet wurde&quot; (#4794) Exportdateinamen optimiert Optik des Adminbereichs optimiert Adminseitentitel angepasst Apache 2.4-Kompatibilität eingefügt Querycheck ergänzt Angleichung an Auftragsmanager für vereinfachten Featuretransfer Datenbankabfragen korrigiert 2.3.0.0 OXID 4.9 \/ 5.2 Installationsanweisungen eingefügt Cronjob-ID für gezieltere Aufgabenaufrufe integriert Remark- und Info-Handling optimiert alternative From- und Reply-Adresse in Mailsendeaktion integriert Templatequelle für Mailsendeaktion kann nun auch ein Modulverzeichnis sein Templatestruktur bereinigt SH-Generator integriert Cronjob-ID für Shellaufrufe nachgetragen Optimierung für Multilang-Tabellen integriert zu bearbeitendes Kundenkonto wird separat (außerhalb der userlist) geladen, sind sonst unvollständig einzelne Modprofile-Felder von Multilang-Speicherung ausgeschlossen, da Aufgaben nicht sprachabhängig ausgeführt werden können Performance: Statistikabfragen optimiert Performance: Statistikauswertungen können einzeln abgefragt werden Zeit-Bedingungen für stehengelassene Warenkörbe eingefügt Zeit-Bedingung für bestellte Warenkörbe eingefügt 2.2.0.0 zusätzliche Bedingungen integriert nach gespeicherten Warenkörben (ja \/ nein) nach gespeicherten Merkzetteln (ja \/ nein \/ Anzahl) nach gespeicherten Wunschzetteln (ja \/ nein \/ Anzahl) nach verwendeten Gutscheinen (ja \/ nein \/ Gutscheinnummer \/ Gutscheinserie) Alter (&lt; \/ &gt; \/ =) Freifeldprüfung an Bestellungen Hilfetexte vervollständigt Modul schreibt umfangreicheres Logging über Ausführung Aktivstatus für &quot;manuell&quot; und &quot;Ausführung per Cronjob&quot; eindeutiger definiert Aufgabenbeschreibung als Langtext Beschreibung der Beispielaufgaben vervollständigt zusätzliche Beispielaufgabe eingefügt 2.1.1.0 Bedingungen: Filterung nach Umsatzzahlen aus allen Bestellungen des Kunden Korrektur: Aufgabe &quot;Warenkorbabbrecher reaktivieren&quot; verursacht einen Fatal Error 2.1.0.1 &quot;Auftrag manuell ausführbar&quot;-Option korrigiert Cronjob-Fehler werden zusätzlich im Cronjob ausgegeben 2.1.0.0 (aus Kompatibilitätsgründen zu Ordermanager-Release) grundsätzliche Filter- und Ausführungsoptionen eingefügt neues Lizenzschema integriert","tags":"","url":"changelog\/Changelog.html"},{"title":"Editionen","text":"Das Modul Kundenmanager erhalten Sie in verschiedenen Editionen mit unterschiedlichem Funktionsumfang. Die hier nicht genannten Modulfunktionen sind in allen Editionen gleich. Funktionsumfang Free-Edition Standard-Edition Premium-Edition Anzahl möglicher Aufgaben 5 25 beliebig vor-Ausführung-Script möglich X nach-Ausführung-Script möglich X Aufgabenauslöser Free-Edition Standard-Edition Premium-Edition periodischer Start per Cronjob X X X manueller Start direkt an den Kundenkonten X X X beim Bestellabschluss durch den Kunden X X beim Speichern der Kundenkontos X X Bedingungen Free-Edition Standard-Edition Premium-Edition Aktivhaken gesetzt \/ nicht gesetzt X X X Registrierdatum nach X X X Registrierdatum vor X X X Zeitpunkt des Registrierdatums X X X Kundennummer größer oder gleich X X X Kundennummer kleiner oder gleich X X X Passwort gesetzt \/ nicht gesetzt X X X in Kundengruppe X X X nicht in Kundengruppe X X X Newsletterempfang gesetzt \/ nicht gesetzt X X X hat Geburtstag X X X Geburtsdatum nach X X X Geburtsdatum vor X X X Alter X X X Newsletter-Mailadresse gültig \/ nicht gültig X X X Bonität X X X Lieferadresse gesetzt \/ nicht gesetzt X X X Geschlecht (Rechnungsadresse) X X X Land (Rechnungsadresse) X X X PLZ-Bereich (Rechnungsadresse) X X X Firmenname (Rechnungsadresse) X X X Umsatzsteuer-ID (Rechnungsadresse) X X X Geschlecht (Lieferadresse) X X X Land (Lieferadresse) X X X PLZ-Bereich (Lieferadresse) X X X Firmenname (Lieferadresse) X X X hat keine Bestellungen X X X Mindestanzahl Bestellungen X X X Höchstanzahl Bestellungen X X X ...summe aller Bestellungen kleiner als X X X ...summe aller Bestellungen größer als X X X Bestellzeit älter als X X X Bestellzeit jünger als X X X erste \/ letzte Bestellzeit älter \/ jünger X X X verwendete Zahlart X X X verwendete Versandart X X X Bestellung in Sprache X X X Gutscheine verwendet \/ nicht verwendet X X X verwendete Gutscheinnummer X X X verwendete Gutscheinserie X X X gespeicherter Warenkorb vorhanden \/ nicht vorhanden X X X gespeicherter Warenkorb nach Datum X X X gespeicherter Warenkorb vor Datum X X X Zeitraum ab letzter Änderung des gespeicherten Warenkorbes X X X gespeicherter Notizzettel vorhanden \/ nicht vorhanden X X X Anzahl gespeicherter Notizzettel X X X gespeicherter Wunschzettel vorhanden \/ nicht vorhanden X X X Anzahl gespeicherter Wunschzettel X X X Methode des Kundenlistenobjektes ausführen X Adressfeld auf Wert prüfen (Rechnungsadresse) X Adressfeld auf Wert prüfen (Lieferadresse) X Bestellungsfeld auf Wert prüfen X andere Aufgabe ausgeführt \/ nicht ausgeführt X Aktionen Free-Edition Standard-Edition Premium-Edition Aktivhaken setzen \/ entfernen X X in Gruppe zuordnen X X aus Gruppe entfernen X X E-Mail senden X X X Kunden in Liste exportieren X X Methode des Kundenobjektes ausführen X Kundenfeld mit Wert füllen X Kundenkonto löschen X X Push-Notification senden X","tags":"","url":"editions\/Editionen.html"},{"title":"Installation \/ Update \/ Deinstallation","text":"Anforderungen Neuinstallation Update Deinstallation Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unter Hilfe und Support genannten Kontaktdaten Bescheid.","tags":"","url":"installation\/Installation.html"},{"title":"Systemanforderungen","text":"PHP Version 7.1.x bis 7.4.x PHP Decoder installierter ionCube Loader Shopversionen \/ -editionen OXID eShop Community Edition (CE), Professional Edition (PE) oder Enterprise Edition (EE) in Compilation Version 6.2.x Themes Das Modul benötigt keine Einbindung ins Frontend und ist damit von diesen Themes unabhängig. D3 Modul-Connector (kostenfrei bei D3 erhältlich) ab Version 5.3.1.2 Installation via Composer mindestens ein freier Cronjob zur automatischen Ausführung der angelegten Aufgaben Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für PHP 7.1, PHP 7.2, PHP 7.3 oder PHP 7.4 sowie dem auf Ihrem Server vorhandenen Decoder (ionCube Loader) kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Kompatibilität mit anderen Modulen","text":"Das Modul Kundenmanager integriert sich auch in die Erweiterung &quot;Visual CMS&quot; von OXID eSales AG &amp; digidesk - media solutions, sofern diese im Shop installiert wurde. Diese Integration wurde für die Version 3.0.0 des &quot;Visual CMS&quot;-Moduls entwickelt. Der Kundenmanager ist natürlich auch ohne das &quot;WYSIWYG Editor + Mediathek&quot;-Modul einsetzbar.","tags":"","url":"installation\/Anforderungen\/Kompatibilitaet_mit_anderen_Modulen.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den kostenfreien Connector. Informationen zu dessen Installation finden Sie auf unserer Homepage. Klicken Sie auf den Reiter Downloads und wählen dort das für Ihre Installation passende Paket.","tags":"","url":"installation\/Anforderungen\/Vorbereitungen.html"},{"title":"Neuinstallation","text":"Schnellstart per Composer php composer require d3\/usermanager:^4.1.1.0 --update-no-dev Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Seiten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den Modul-Connector bitte vorab. Hinweise zu dessen Installation finden Sie in der Modul-Connector Dokumentation.","tags":"","url":"installation\/Neuinstallation\/Vorbereitung.html"},{"title":"Modul zur Installation hinzufügen","text":"Führen Sie in der Konsole im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) diesen Befehl aus, um das Modul Kundenmanager zur Installation hinzuzufügen: php composer require d3\/usermanager:^4.1.1.0 --update-no-dev Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Treffen Sie bei der Installation auf spezielle Anforderungen, zu denen Sie Unterstützung benötigen, kontaktieren Sie uns bitte für weiteren Support.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Modul im Shop aktivieren","text":"Aktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Kundenmanager auf den Button Aktivieren. Enterprise Editon: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen.","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"Direkt nach der Modulaktivierung startet der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen.","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel eintragen","text":"Das Modul verwendet Lizenzschlüssel, um die Lizenzverwaltung für Sie und auch für uns einfacher zu gestalten. Hierbei haben Sie je nach Modul die Wahl zwischen einer kostenfreien Testlizenz und einer Lizenz für den Einsatz im Livebetrieb. Speziell Kundenmanager wird in unterschiedlichen (teilweise kostenfreien) Editionen für den Livebetrieb angeboten. Besuchen Sie unseren Moduleshop, um mehr darüber zu erfahren. Rufen Sie zum Anfordern des Lizenzschlüssels die Modulverwaltung im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung auf. Klappen Sie den Eintrag des jeweiligen Moduls aus. Sofern erforderlich, können Sie hier den Lizenzassistenten starten, der schnell und einfach ihr Modul aktiviert.","tags":"","url":"installation\/Neuinstallation\/Lizenz_eintragen.html"},{"title":"Cronjob einrichten","text":"Legen Sie den Cronjob für die automatische Bearbeitung der eingerichteten Aufträge an. Die für die Anlage benötigten Daten finden Sie im Adminbereich des Moduls unter Module -&gt; Kundenmanager -&gt; Einstellungen -&gt; Grundeinstellungen. Weitere Informationen zum Anlegen von Cronjobs finden Sie in unserer FAQ. Sie sollten unbedingt den Aufruf von .sh-Dateien via Browser verhindern, so dass kein Unbefugter die Datei von außen aufrufen kann. Dazu können Sie z.B. die .htaccess-Datei des Shops um folgende Zeilen erweitern: &lt;Files *.sh&gt; Require all denied &lt;\/Files&gt;","tags":"","url":"installation\/Neuinstallation\/Cronjob_einrichten.html"},{"title":"Updatefähigkeit","text":"Bei individuellen Änderungen von Moduldateien empfehlen wir, jeweils die Überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Beachten Sie, dass Moduldateien bei Updateinstallationen überschrieben werden. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefaehigkeit.html"},{"title":"Wann kann ein Update ausgeführt werden?","text":"Die Updateanweisungen können verwendet werden, wenn dieses Modul schon früher mit Hilfe von Composer installiert wurde. Wurde die Installation bisher noch nicht durchgeführt oder die Installation wurde nicht über Composer durchgeführt (weil das Modul dies z.B. früher nicht unterstützte), verwenden Sie bitte die Beschreibung unter Neuinstallation.","tags":"","url":"installation\/Update\/Updatedefinition.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Kundenmanager auf den Button Deaktivieren.","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Dateien erneuern","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie dort diesen Befehl aus: php composer require d3\/usermanager:^4.1.1.0 --update-no-dev Im weiteren Ablauf werden Sie gefragt, ob die Moduldateien überschrieben werden sollen. Bestätigen Sie dies für den Eintrag d3\/usermanager. Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Treffen Sie bei der Installation auf spezielle Anforderungen, zu denen Sie Unterstützung benötigen, kontaktieren Sie uns bitte für weiteren Support.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Kundenmanager auf den Button Aktivieren.","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installieren","text":"Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen.","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel aktualisieren","text":"Wird für die neue Modulversion ein aktualisierter Lizenzschlüssel benötigt, tragen Sie diesen im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung ein. Klappen Sie dazu den Eintrag des jeweiligen Moduls aus und starten den Lizenzassistent.","tags":"","url":"installation\/Update\/Lizenzschluessel_aktualisieren.html"},{"title":"Erweiterungen anpassen","text":"Haben Sie für dieses Modul eigene Erweiterung entwickelt, gleichen Sie dies bitte mit der neuen Fassung des Moduls ab.","tags":"","url":"installation\/Update\/Erweiterungen_anpassen.html"},{"title":"Installationsprüfung","text":"Um die erfolgreiche Installation zu prüfen, können Sie die folgende(n) Checkliste(n) verwenden: Einstellungsunabhängige Prüfungen Backend Modul ist unter Erweiterungen -&gt; Module aktiv geschaltet Modul ist unter Module -&gt; Modul-Connector -&gt; Modulverwaltung aktiv geschaltet Modul zeigt unter Module -&gt; Kundenmanager einen eigenen Bereich für Einstellungen Modul zeigt unter Benutzer verwalten -&gt; Benutzer -&gt; Kundenmanager einen eigenen Bereich","tags":"","url":"installation\/Installationspruefung.html"},{"title":"Schnellstart","text":"Das Modul Kundenmanager bringt einen umfangreichen Adminbereich mit, in dem Sie die Konfigurationseinstellungen des Moduls setzen können. Über das Menü Module -&gt; Kundenmanager -&gt; Einstellungen erreichen Sie die Einstellseiten. Arbeiten Sie idealerweise die Optionen einmal durch. Hinweise zu den einzelnen Einstellungen finden Sie in dem dahinter stehenden Fragezeichenfeld. Durch einen Klick darauf öffnet sich der Hinweistext. Richten Sie nun die Aufgaben ein, die der &quot;Kundenmanager&quot; für Sie durchführen soll. In der Standardinstallation finden Sie einige Aufgaben als Beispiel vorbereitet. Darin können Sie sich die möglichen Konfigurationen ansehen, diese auf Ihre Bedürfnisse anpassen und auch neue Aufgaben anlegen. Testen Sie die Aufgaben mit dem modulweiten Debug-Schalter ( Module -&gt; Kundenmanager -&gt; Einstellungen) und \/ oder der Mailsende-Option an jeder Aufgabe ( Module -&gt; Kundenmanager -&gt; Aufgaben -&gt; Stamm). Diese Optionen sind genauer im jeweils dahinter stehenden Fragezeichenfeld erklärt. Aktivieren Sie die Ausführung der Aufgaben bitte erst, wenn Sie sicher sind, dass alle Optionen richtig sind. Wir übernehmen keine Gewährleistung für evtl. falsche oder verlorene Daten bei fehlerhaft eingestellten Aufgaben. Weitere Details zur Einrichtung des &quot;Kundenmanagers&quot; entnehmen Sie bitte dessen Handbuch zum Modul.","tags":"","url":"installation\/Schnellstart.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul Kundenmanager aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul Kundenmanager über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Kundenmanager auf den Button Deaktivieren.","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/usermanager --no-update Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner usermanager und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"Datenbank bereinigen","text":"Das Modul legt Informationen in der Datenbank ab. Sofern diese Daten nicht mehr benötigt werden, können diese gelöscht werden. Legen Sie sich vorab bitte unbedingt eine Sicherung an, um die Daten im Zweifelsfall wiederherstellen zu können. Für das Modul Kundenmanager sind dies die folgende Tabellen und Felder: die komplette Tabelle d3user2usermanager und diese Felder in bestehenden Tabellen: in Tabelle d3modprofile: das Feld D3_UM_EXECMANUALLY das Feld D3_UM_MARKUSER das Feld D3_UM_USERSAVETRIGGERED das Feld D3_UM_ORDERFINISHTRIGGERED sowie diese Einträge in bestehenden Tabellen: in Tabelle d3_cfg_mod: den Eintrag oxmodid = &quot;d3usermanager&quot; **) **) Diesen Eintrag gibt es ggf. für jeden Subshop. Entfernen Sie diesen nur für die Mandanten, in denen das Modul nicht mehr installiert ist.","tags":"","url":"installation\/Deinstallation\/Datenbank_bereinigen.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Handbuch","text":"Der Kundenmanager ist dafür erstellt, Ihnen möglicherweise lästige, jedoch immer wiederkehrende Aufgaben in Ihrem OXID-Shop abzunehmen. Die Aufgabenliste arbeitet anhand der Liste aller Kundenkonten die eingestellten Aufgaben entweder manuell oder sogar automatisch ab. Bevor Sie den Kundenmanager nutzen können, führen Sie bitte dessen Installation durch. Die erforderlichen Schritte werden ausführlich in der Installationsanleitung beschrieben. Die Einstellungen des Moduls setzen Sie im Adminbereich Ihres OXID-Shops. Wählen Sie dazu im linken Menü den Bereich Module -&gt; Kundenmanager.","tags":"","url":"manual\/Handbuch.html"},{"title":"Grundeinstellungen","text":"Hier setzen Sie alle Einstellungen, die unabhängig von Ihren gesetzten Aufgaben für die Ausführung des Kundenmanagers notwendig sind: Setzen Sie das Modul aktiv: Ohne den Aktiv-Haken können Sie das Modul zwar einrichten, jedoch wird keine der angelegten Aufgaben ausgeführt. Über Debug aktiv lassen sich Informationen während der Ausführung des Moduls ausgeben, die Ihnen und uns nützliche Hinweise zu einer möglichen Fehlersuche geben. Im Normalbetrieb sollte dieser Haken nicht gesetzt sein, da sonst die Aktionen nicht ausgeführt werden. In der Logging-Auswahl stellen Sie ein, ob und wie viele Protokollinformationen der Kundenmanager mitschreiben soll. Die Daten helfen uns bei einer möglichen Ursachensuche, wenn die Auftragsabarbeitung doch einmal nicht wie gewünscht arbeiten sollte. Die Protokolleinträge werden ausschließlich in Ihrer Installation abgelegt. Treffen Sie bei der Entscheidung den Kompromiss zwischen einem ausreichenden Protokoll und dem Speicherplatzbedarf. Im Regelfall ist die Einstellung &quot;Fehler mitschreiben&quot; ausreichend.","tags":"","url":"manual\/Einstellungen\/Grundeinstellungen.html"},{"title":"Aufgabeneinstellungen -> Ordner","text":"Der Kundenmanager lässt aus technischer Sicht beliebig viele Aufgaben zu. Um diese besser verwalten und wiederfinden zu können, legen Sie die Aufgaben in virtuelle Ordner. Eben diese Ordner können Sie hier verwalten. Jede Zeile im Eingabebereich stellt einen Ordner dar. Möchten Sie einen neuen Ordner hinzufügen, fügen Sie eine neue Zeile ein. Zum Löschen eines Ordners entfernen Sie die betreffende Zeile. Den Namen des Ordners können Sie im Eingabefeld im Klartext eingeben. Alternativ (speziell für mehrsprachige Shops) können Sie stattdessen auch einen Multilang-Baustein eintragen, den Sie in den admineigenen Übersetzungsdateien hinterlegen. Es empfiehlt sich, die Ordner inhaltsbezogen zu den Aufgaben anzulegen. Speichern Sie gesetzte Einstellungen ab.","tags":"","url":"manual\/Einstellungen\/Aufgabeneinstellungen.html"},{"title":"allgemeine Cronjobeinstellungen","text":"Neben der manuell gestarteten Aufgabenausführung können diese auch automatisch über einen oder mehrere Cronjobs gestartet werden. Cronjobs werden auf dem Server eingerichtet und starten die Skriptausführung auch ohne Ihr Zutun. Setzen Sie hier die Cronjob-Ausführung aktiv, wenn Sie die automatische Abarbeitung nutzen möchten. Tragen Sie auch die Anzahl der Bestellungen ein, die pro Cronjob-Aufruf abgearbeitet werden dürfen. Die Menge ist begrenzt, da auch ein Cronjob nur eine vom Server vorgegebene Zeit zur Abarbeitung hat. Jede Bestellung benötigt ebenfalls etwas Zeit. Je nach Anzahl der aufgelaufenen Bestellungen und der auszuführenden Aufgaben sollte diese Anzahl justiert werden. Reicht die maximal nutzbare Anzahl der Kundenkonten nicht aus, lassen Sie den Cronjob einfach mehrmals laufen (z.B. alle 2 Stunden). Das Cronjob-Skript können Sie (und jeder Andere auch) zur Einrichtung oder zur Kontrolle im Browser aufrufen. Neben den serverseitigen Sicherheitsmaßnahmen sollten Sie hier ein Passwort vergeben, mit dem das Skript ausschließlich gestartet werden kann. Ohne das Passwort verweigert der Kundenmanager seine Arbeit. So stellen Sie sicher, dass kein Unbefugter diese Ausführung startet.","tags":"","url":"manual\/Einstellungen\/allgemeine_Cronjobeinstellungen.html"},{"title":"Cronjobeinstellungen für Cronjob-ID \"X\"","text":"Der Kundenmanager stellt verschiedene Cronjobs zur Verfügung. Je nach Einrichtung der Aufgaben kann die Anzahl variieren. Details zur Verwendung der Cronjob-IDs finden Sie im Abschnitt Aufgaben automatisch ausführen. Für jeden verfügbaren Cronjob sehen Sie in den Einstellungen die für Einrichtung benötigten Informationen: Den Link mit allen erforderlichen Parametern für den manuellen Aufruf des Bearbeitungsskripts finden Sie in der Zeile &quot;externer Link&quot;. Über den blauen Button können Sie die Ausführung in einem neuen Browser-Tab sofort starten. Direkt darunter finden Sie den Link, den Sie für die Einrichtung des Cronjobs benötigen. Dort ist das Passwort nicht nötigt, da Ihr Server die Identifizierung selbst durchführen kann. Nachfolgend wird ebenfalls die Zeit gezeigt, zu der dieser Cronjob das letzte Mal erfolgreich gestartet wurde. Haben Sie Zweifel an der Cronjob-Einrichtung bei Ihrem Provider, können Sie dies hier kontrollieren. Speichern Sie gesetzte Einstellungen ab. Enterprise Editon mit mehr als einem Shopmandanten: Beachten Sie, dass für jeden Shopmandanten ein eigener Link zum Aufruf des Cronjobs existiert. Legen Sie sich für jeden Subshop daher einen eigenen Cronjob an. Es empfiehlt sich, diese zeitversetzt zu planen.","tags":"","url":"manual\/Einstellungen\/Cronjobeinstellungen_fuer_Cronjob-ID.html"},{"title":"Aufgaben","text":"Dem Modul haben wir in der Standardinstallation schon einige Aufgaben als Beispiele mitgeliefert. Daran können Sie sich die Einrichtungsmöglichkeiten für verschiedenste Anwendungsfälle ansehen. Lassen Sie sich jedoch bitte nicht von den Beispielen einschränken. Wir sind gespannt, welche Aufgabenkombinationen Sie mit dem Kundenmanager umsetzen. Zum Auswählen einer Aufgabe klicken Sie diese in der oben gezeigten Liste an. Die jeweilige Zeile wird farbig hinterlegt. Im unteren Bereich der Anzeige sehen Sie nun die Details zur Aufgabe. Die Aufgabenliste bietet Ihnen außerdem die Möglichkeit, die angezeigten Aufgaben zu filtern. Über die Eingabe- und Dropdown-Felder können Sie zum Beispiel die weiter oben angesprochenen Ordner zur Filterung verwenden oder nach dem Namen einer Aufgabe suchen. Möchten Sie stattdessen eine völlig neue Aufgabe anlegen, klicken Sie im unteren Bereich der Anzeige auf den entsprechend benannten Link. Das Eingabeformular leert sich und Sie können mit der Eingabe beginnen.","tags":"","url":"manual\/Aufgaben\/index.html"},{"title":"Stamm","text":"Vergeben Sie dem Job einen Namen. Diesen können Sie später jederzeit ändern. Das Reihenfolge-Feld erwartet eine Zahl von Ihnen. Anhand derer wird bei der Ausführung festgelegt, in welcher Reihenfolge Ihre Aufgaben ausgeführt werden. Kleine Zahlen werden vor Aufgaben mit großer Sortierzahl ausgeführt. Dies kann wichtig sein, wenn eine Aufgabe auf den Veränderungen einer anderen Aufgabe basiert. Wählen Sie für Ihre Aufgabe nun noch einen Ordner. Dies dient der besseren Übersicht über Ihre Aufgaben. Die Ordner selbst können Sie in den Grundeinstellungen des Moduls verwalten. Darunter können Sie zusätzlich ablesen, wann diese Aufgabe das letzte Mal ausgeführt wurde. Bei der Neuanlage ist dieser Eintrag natürlich noch leer. Nun widmen wir uns den Einstellungen auf der rechten Seite: Mit Aufgabenausführung nur simulieren geben Sie an, ob diese Aufgabe Änderungen an Ihren Bestelldaten vornehmen darf. Ist der Haken gesetzt, sind alle Einstellungen ohne Auswirkungen. Wünschen Sie nach der Bearbeitung dieser Aufgabe (egal ob live oder nur Simulation) eine Information per Mail, welche Bestellung mit welchen Aktionen behandelt wurden, wird mit Infomail an Shopbetreiber senden diese direkt nach Bearbeitung versendet. Speichern Sie gesetzte Einstellungen ab.","tags":"","url":"manual\/Aufgaben\/Stamm.html"},{"title":"Mall","text":"Für Nutzer der OXID eShop Enterprise Edition gibt es hier die Möglichkeit, die Aufgaben neben dem Hauptmandanten auch weiteren Shopmandanten zuzuweisen. Somit ersparen Sie sich das Anlegen und Pflegen identischer Aufgaben. Beachten Sie jedoch, dass für jeden Mandanten unabhängig dieser Zuweisung separate Cronjobaufrufe notwendig sind. (siehe Cronjobeinstellungen).","tags":"","url":"manual\/Aufgaben\/Mall.html"},{"title":"Übersicht","text":"Hier erhalten Sie eine Übersicht über schon bearbeitete und zukünftige Kundenkonten dieser Aufgabe. Anhand der noch zu bearbeitenden Kundenkonten können Sie die Bedingungseinstellungen prüfen, die diese Zahl direkt manipulieren. Für die einfache Übersicht über eingestellte Bedingungen und Aktionen werden diese hier ebenfalls aufgelistet.","tags":"","url":"manual\/Aufgaben\/Uebersicht.html"},{"title":"Auslöser","text":"Hier stellen Sie ein, wann und wie die Augabe gestartet werden kann. Sie haben die Wahl zwischen: zeitgesteuerter Cronjob Lassen Sie die Aufgabe immer zu vorab festgelegten Zeiten starten. Sie müssen sich dann um die Ausführung nicht kümmern. Der automatische Auführung über Cronjob möglich-Haken definiert, ob diese Aufgabe über die Cronjobs ausgeführt werden darf. Der Einstellung der Cronjob-ID widmet sich das Kapitel Cronjobs für unterschiedlich zu steuernde Aufgaben ausführlich. Beachten Sie bitte, das zusätzlich zu diesen Einstellungen ein passender Cronjob auf Ihrem Server eingerichtet sein muss. Der Ablauf der Einrichtung ist von Ihrem Provider abhängig. Bei Fragen kontaktieren Sie bitte uns oder Ihren Provider. Mit Bearbeitete Kundenkonten nicht als erledigt markieren wird nach erfolgreichem Abschluss der Aufgabe diese auch für die nächste Ausführung erneut vorgemerkt. Verwenden Sie Ihre Aufgabe als Wiedervorlage, setzen Sie diesen Haken. Alle zutreffenden Kundenkonten (auch die aktuell bearbeiteten) werden beim nächsten Aufruf erneut bearbeitet. Ansonsten werden die bearbeiteten Kundenkonten mit dieser Aufgabe nicht noch einmal behandelt. Speziell für die Aufgaben ohne Bearbeitungsmarkierung kann der regelmäßige (z.B. tägliche) Aufruf zu häufig sein. Stellen Sie dann den Wiedervorlagezeitraum ein, wann die Aufgabe erneut ausgeführt werden soll. Beachten Sie bitte: Die Aufgaben können unabhängig des eingestellten Zeitraums nur ausgeführt werden, wenn auch das Cronjob-Skript gestartet wird. Ansonsten bleibt die Aufgabe bis zum nächsten Cronjob unbearbeitet liegen. manuelle Ausführung Alle Aufgaben können auch manuell für jede Bestellung ausgeführt werden. Ob dies für die Aufgabe sinnvoll erscheint, können Sie mit dem Haken manuelle Ausführung an Kundenkonto möglich festlegen. Haben Sie den Haken gesetzt, wird diese Aufgabe an den Kundenkonten (im Admin unter Benutzer verwalten -&gt; Benutzer -&gt; D3 Kundenmanager) angezeigt. (siehe auch Aufgaben manuell ausführen). Mit &quot;Aufgabe wird nur bei Kundenkonten angeboten, bei denen die eingestellten Bedingungen erfüllt sind&quot; können Sie entscheiden, ob die Aufgabe an jedem Kundenkonto angezeigt werden soll oder nur an Konten, die die eingestellten Bedingungen erfüllen. nach dem Abschluss der Bestellung durch den Kunden Die Aufgabe wird dann ausgeführt, wenn der Kunde seine Bestellung im Bestellschritt 4 abgesendet hat und diese vom angelegt wurde. Die Aufgabe führt dann nur das Kundenkonte dieser einen Bestellung aus, wenn dieses die eingestellten Bedingungen erfüllt. Technisch gesehen erfolgt die Bearbeitung der Bestellung nach Ausführung von \\OxidEsales\\Eshop\\Application\\Model\\Order::finalizeOrder() nach jedem Speichern des Kundenkontos Die Ausführung der Aufgabe erfolgt immer dann, wenn ein Kundenkonto gespeichert wird. Je nachdem, ob das bearbeitet Kundenkonto als &quot;erledigt&quot; markiert wird, erfolgt (k)eine erneute Bearbeitung beim nächsten Speichern. Technisch gesehen erfolgt die Bearbeitung der Bestellung nach Ausführung von \\OxidEsales\\Eshop\\Application\\Model\\User::save() Aktive Auslöser werden für die schnelle Übersicht mit einen grünen Häkchen markiert. An jedem Auslöser können Sie die Ausführung einer Vorabsriptes und \/ oder eines Danachscriptes einstellen, welches vorbereitende oder nachbereitende Arbeiten ausführt (nur verfügbar in der Premium-Edition. Speichern Sie gesetzte Einstellungen ab.","tags":"","url":"manual\/Aufgaben\/Ausloeser.html"},{"title":"Bedingungen","text":"Hier legen Sie mit einfachen Möglichkeiten fest, welche Bestellungen überhaupt von Ihrer Aufgabe betroffen sind. Lässt sich Ihre Aufgabe nicht eindeutig diesen Bedingungen zuordnen, legen Sie im Anschluss besser eine zweite (identische) Aufgabe an und variieren Sie die Bedingungen entsprechend. Jede Bedingung hat einen Aktiv-Haken. Nur wenn dieser gesetzt ist, werden auch alle weiteren Einstellungen der jeweiligen Bedingung berücksichtigt. Alle Bedingungen sind miteinander kombinierbar. Wählen Sie mehrere Bedingungen aus, müssen die Bestellungen Ihres Shops auch allen gewählten Bedingungen entsprechen (UND-Verknüpfung). Für alternative Bedingungen (ODER-Verknüpfung) legen Sie sich bitte entsprechend viele ähnlich gestaltete Aufgaben an. Die Bedingungen sind selbsterklärend, weshalb das Handbuch nur auf Besonderheiten eingehen wird. Weitere Hilfetexte finden Sie an den Fragezeichenfeldern direkt an jeder Bedingung: Eine Spanne in den vorliegenden Bestellungen können Sie mit der Kombination aus ab Kundennummer und bis Kundennummer erstellen. Geben Sie hier die kleinste und die größte Kundennummer an. Bei Auswahlfeldern mit mehreren Einträgen können Sie auch mehrfache Einträge selektieren. Halten Sie dazu während der Auswahl die -Taste gedrückt oder verwenden die Eingabehilfe, um alle bzw. keine Einträge zu markieren. Alle Bedingungen, die sich auf Währungsmengen (z.B. Bestellsummen) beziehen, verwenden die Angabe immer in der Shop-Hauptwährung. Rechnen Sie Angaben in Fremdwährung für die Bedingungen daher bitte immer um. Geben Sie bei Prüfung eines Freitextfeldes als Feldname immer das Stammfeld an. Die Angabe des sprachabhängigen Suffix (z.B. ..._1) wird vom Modul bei Bedarf selbst vorgenommen. Details zu den jeweiligen Eingabefeldern der Bedingungen finden Sie im Admin im Hilfefeld hinter der entsprechenden Eingabe. Speichern Sie gesetzte Einstellungen ab.","tags":"","url":"manual\/Aufgaben\/Bedingungen.html"},{"title":"Aktionen","text":"Haben Sie die Bedingungen gesetzt, setzen Sie nun die Aktionen, die ausschließlich auf die gefundenen Kundenkonten angewendet werden. Auch hier verzichten wir in diesem Handbuch auf die Auflistung der Aktionen, da diese normalerweise selbsterklärend sind. Im Folgenden sind nun Besonderheiten aufgeführt, auf die Sie speziell achten sollten: Beachten Sie, dass die Aktion &quot;Löschen von Konten&quot; nicht rückgängig gemacht werden kann. Lassen Sie bei solchen Aktionen erst während eines Testzeitraums die Infomails zusenden, mit denen Sie prüfen können, ob die Löschaktionen auch die richtigen Bestellungen betreffen. Wir übernehmen keine Gewährleistung bei Datenverlust auf Grund von unzureichend geprüften Aufgaben. Alle Aktionen, die sich auf Währungsmengen beziehen (z.B. Versandkosten oder Rabatte), verwenden die Angabe immer in der Shop-Hauptwährung. Rechnen Sie Angaben in Fremdwährung für die Aktionen daher bitte immer um. Geben Sie bei Veränderung eines Freitextfeldes als Feldname immer das Stammfeld an. Die Angabe des sprachabhängigen Suffix (z.B. ..._1) wird vom Modul bei Bedarf selbst vorgenommen. Beim Versand von Mails können Sie als Quelle Ihres Mailinhalts CMS-Bausteine aus Ihrem Shop oder komplette Templatedateien verwenden. In beiden Möglichkeiten haben Sie die folgenden Variablen zur Verfügung, um die Mail zu individualisieren: Variable Inhalt $oShop enthält das Shop-Objekt und alle seine Möglichkeiten $shop enthält das Shop-Objekt und alle seine Möglichkeiten $oViewConf enthält das Shop-Objekt und alle seine Möglichkeiten $oOrder enthält das Bestellungen-Objekt und alle seine Möglichkeiten $order enthält das Bestellungen-Objekt und alle seine Möglichkeiten $oUser enthält das Benutzer-Objekt und alle seine Möglichkeiten $user enthält das Benutzer-Objekt und alle seine Möglichkeiten $shopTemplateDir enthält das Verzeichnis zum Template $charset enthält den Zeichensatz für die Mail $basket enthält das Warenkorb-Objekt und alle seine Möglichkeiten (erfordert, dass alle Artikel noch im Stamm vorhanden sind) $payment enthält das Bezahlarten-Objekt und alle seine Möglichkeiten $oDelSet enthält das Versandarten-Objekt und alle seine Möglichkeiten $currency enthält das Währungs-Objekt und alle seine Möglichkeiten Legen Sie die Templatedateien im auszuwählenden Ordner ab.","tags":"","url":"manual\/Aufgaben\/Aktionen.html"},{"title":"Logging","text":"Alle Protokolleinträge, die für dieses Modul aufgezeichnet werden, finden Sie in dieser Übersicht.","tags":"","url":"manual\/Logging.html"},{"title":"Aufgaben automatisch ausführen","text":"Richten Sie sich auf Ihrem Server einen oder mehrere Cronjobs ein, der den Link aus dem Einstellungsdialog enthält. Der Cronjob kann je nach Erfordernissen auch mehrfach am Tag ausgeführt werden. Dies ist hauptsächlich von der Anzahl der Kundenkonten und den angelegten Aufgaben Ihres Shops abhängig. Sofern bei Ihrem Provider notwendig, binden Sie statt der PHP-Datei die gleichnamige SH- Datei als Cronjob-Skript ein. Ändern Sie den Inhalt der SH-Datei zuvor auf Ihre Servereinstellungen. Sie sollten unbedingt den Aufruf von .sh-Dateien per Browser verhindern, so dass kein Unbefugter diese Datei von außen aufrufen kann. Dazu erweitern Sie z.B. die .htaccess- Datei des Shops um folgende Zeilen: &lt;Files *.sh&gt; order allow,deny deny from all &lt;\/Files&gt;","tags":"","url":"manual\/Aufgaben_automatisch_ausfuehren.html"},{"title":"Cronjobs für unterschiedlich zu steuernde Aufgaben","text":"Neu angelegte Aufgaben oder Aufgaben, denen Sie keine spezielle Cronjob-ID zugewiesen haben, erhalten standardmäßig immer die Cronjob-ID &quot;0&quot; (Null). Noch nicht zugeordnete oder neu angelegte Aufgaben können Sie gesamt über diese Cronjob-ID steuern. Hierfür können Sie mit den in den Modul-Grundeinstellungen angezeigten Daten einen Cronjob einrichten, der diese Aufgaben automatisch ausführt. Häufig ist es jedoch der Fall, dass bestimmte Aufgaben nur zu besonderen Zeiten gestartet werden sollen. Beispiele sind: Erstellen von Auswertungen nur einmal im Quartal oder Marketingaktionen immer zu Beginn eines jeden Monats oder Geburtstagsglückwünsche immer vormittags statt nachts Weisen Sie dann diesen speziellen Aufgaben jeweils eine eigene Cronjob-ID zu. Diese kann eine beliebige Zahl zwischen 1 und 99 sein. Verwenden mehrere Aufgaben dieselben Ausführungszeiten und Intervalle, können Sie diese durch Vergabe der gleichen Cronjob-ID auch zu einer Ausführungsgruppe zusammenfassen. Für diese Gruppe brauchen Sie nur einen gemeinsamen Cronjob einrichten. Sobald Sie die Cronjob-ID an der Aufgabe gespeichert haben, werden Ihnen in den Grundeinstellungen des Moduls alle Informationen gezeigt, die Sie für die Einrichtung dieses zusätzlichen Cronjobs benötigen. An diesem Cronjob können Sie nun auch die neuen Ausführungszeiten direkt einstellen. Sofern Ihr Provider dies erfordert, legen Sie für jeden Cronjob eine separate .sh-Datei an (siehe Aufgaben automatisch ausführen). Vorherige Modulversionen verwendeten noch keine Cronjob-ID. Wird der Cronjob ohne ID aufgerufen, verwendet dieser automatisch die ID &quot;0&quot; (Null). Eine Umarbeitung der bisherigen Einstellungen ist nicht nötig.","tags":"","url":"manual\/Cronjobs_fuer_unterschiedlich_zu_steuernde_Aufgaben.html"},{"title":"Aufgaben für alle relevanten Konten manuell ausführen","text":"Die Adressen für einen manuellen Start der Aufgaben finden Sie in den Einstellungen des Kundenmanagers (Klappmenü Cronjobeinstellungen für...). Die Adresse unter externer Link kann zum manuellen Starten verwendet werden. Die Links sind immer für eine spezielle Cronjob-ID gültig. Alle Aufgaben mit dieser ID werden dann gleichzeitig gestartet. Möchten Sie nur eine spezielle Aufgabe starten, vergeben Sie dieser eine eindeutige Cronjob-ID. Sie erhalten dann in den Einstellungen einen speziellen Link nur für diese ID. Weitere Informationen zur Verwendung der Cronjob-IDs sind im Kapitel Cronjobeinstellungen für Cronjob-ID X beschrieben. Beachten Sie bitte, dass die Aufgaben in einem Durchlauf bearbeitet werden. Cronjobs haben im Regelfall mehr Ressourcen (Laufzeit, Speicher, ...) zur Verfügung, als Browseraufrufe. Sind die auszuführenden Aufgaben sehr umfangreich, kann es beim manuellen Aufruf unter Umständen zu Abbrüchen führen, wo der Cronjob sauber durchlaufen würde.","tags":"","url":"manual\/Aufgaben_fuer_alle_relevanten_Kundenkonten_manuell_ausfuehren.html"},{"title":"Aufgaben für einzelne Kundenkonten manuell ausführen","text":"Je nach Einstellung an den Aufgaben können Sie diese für alle Kundenkonten zur manuellen Ausführung bereitstellen. Diese Einstellung setzen Sie an der jeweiligen Aufgabe im Tab Auslöser. Wählen Sie für den manuellen Aufruf im Adminbereich Ihres Shops den Abschnitt Benutzer, wählen das entsprechende Kundenkonto und wechseln dann auf den Tab Kundenmanager. Hier sehen Sie die freigegebenen Aufgaben und deren Status. Mit Hilfe des Ordner-Auswahlfeldes können Sie die angezeigten Aufgaben auch filtern. Hier können Sie Aufgaben nun ausführen, auch wenn deren Bedingungen für das gewählte Kundenkonto eigentlich nicht gültig sind. Eine Prüfung erfolgt nicht. Bei mehrfach ausführbaren Aufgaben steht Ihnen auch nach der ersten Ausführung die erneute Ausführung der Aufgabe jederzeit zur Verfügung. Wurde eine Aufgabe schon abschließend für das Kundenkonto ausgeführt, können Sie diese Markierung hier auch wieder entfernen. Ein erneutes Ausführen (manuell über diese Seite oder auch automatisch über den Cronjob) ist dann wieder möglich. Zusätzlich erlaubt Ihnen die manuelle Ausführung auch das Bearbeiten von Mails. So können Sie ohne Veränderung der Mailvorlagen Ihrem Kunden auch noch individuelle Anpassungen der Mails zukommen lassen.","tags":"","url":"manual\/Aufgaben_fuer_einzelnes_Kundenkonto_manuell_ausfuehren.html"},{"title":"Anzeige der gefundenen Kundenkonten als Liste","text":"Eine direkte Anzeigemöglichkeit gibt es im Modul nicht, da die Listen sehr lang werden können. Benötigen Sie die Liste vorab, kopieren Sie bitte die Aufgabe und ändern in der Kopie die Aktionen auf &quot;Export in Liste&quot; um. Benötigen Sie stattdessen ein Bearbeitungsprotokoll, können Sie den Listenexport auch in der bestehenden Aufgabe zusätzlich zu den bestehenden Aktionen dazu konfigurieren. Aktivieren Sie in beiden Fällen im Tab &quot;Aktion&quot; im Aufklappmenü &quot;Export&quot; die folgenden Einstellungen: Wählen Sie die gewünschten Felder aus der Feldliste. Als Generierungstemplate wählen Sie d3usermanager\/CSV-Vorlage.tpl. Damit können Sie sich eine CSV-Liste erzeugen. Für andere Formate ist eine entsprechende Vorlage zu erstellen. Nach dem Ausführen dieser Aufgabe können Sie den Export unter dem angezeigten Pfad laden. Wenn Sie eine separate Kopie der Aufgabe für die Listen verwenden: Beachten Sie bitte, dass diese beiden Aufgaben (das Original und auch die Listen-Kopie) jeweils eigene erledigt-Haken an der Bestellung setzen. Die beiden Aufgaben haben damit voneinander getrennte Bearbeitungsstände.","tags":"","url":"manual\/Anzeige_der_gefundenen_Kundenkonten_als_Liste.html"},{"title":"Weiterentwicklung","text":"Fehlen Ihnen unter den Bedingungen oder den Aktionen der Aufgaben noch Einträge, um die von Ihnen benötigte Aufgabe anlegen zu können, fragen Sie einfach bei uns nach. Haben Sie neben den Beispielen weitere Einsatzmöglichkeiten gefunden, freuen wir uns über Ihre Rückmeldung.","tags":"","url":"manual\/Weiterentwicklung.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserem HelpCenter zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr D³-Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}